In [2]:
import pandas as pd

In [4]:
path = 'data.csv'

In [6]:
path

'data.csv'

In [9]:
df=pd.read_csv(path, encoding = 'cp949')

In [11]:
df

      학번    이름   국어  수학   영어   과학
0  30201   1창훈  100  80   70   10
1  30202   2창훈   95  70   60   40
2  30203   3창훈   90  60   50   30
3  30204   4창훈   85  40   90   50
4  30205   5창훈   80  50   80   70
5  30206   6창훈   75  70   90   80
6  30207   7창훈   70  89  100   90
7  30208   8창훈   65  35   50  100
8  30209   9창훈   60  20   70   70
9  30210  10창훈   55  50   60   60

In [13]:
df.head(1)

      학번   이름   국어  수학  영어  과학
0  30201  1창훈  100  80  70  10

In [15]:
df.tail()

      학번    이름  국어  수학   영어   과학
5  30206   6창훈  75  70   90   80
6  30207   7창훈  70  89  100   90
7  30208   8창훈  65  35   50  100
8  30209   9창훈  60  20   70   70
9  30210  10창훈  55  50   60   60

In [17]:
null_count=df.isnull().sum()

In [20]:
df_null_count = null_count.reset_index()
df_null_count

  index  0
0    학번  0
1    이름  0
2    국어  0
3    수학  0
4    영어  0
5    과학  0

In [23]:
df_null_count.columns=['메뉴', '결측']

In [27]:
df_null_count_3 = df_null_count.sort_values(by='결측',ascending=False).head(3)

In [29]:
drop_columns = df_null_count_3['메뉴']

In [31]:
drop_columns.to_list()

['학번', '이름', '국어']

In [33]:
df[drop_columns]

      학번    이름   국어
0  30201   1창훈  100
1  30202   2창훈   95
2  30203   3창훈   90
3  30204   4창훈   85
4  30205   5창훈   80
5  30206   6창훈   75
6  30207   7창훈   70
7  30208   8창훈   65
8  30209   9창훈   60
9  30210  10창훈   55

In [35]:
print(df.shape)

(10, 6)

In [42]:
df.drop(drop_columns, axis=1)

KeyError: "['학번' '이름' '국어'] not found in axis"

In [39]:
print(df.shape)

(10, 3)

In [40]:
df.head()

   수학  영어  과학
0  80  70  10
1  70  60  40
2  60  50  30
3  40  90  50
4  50  80  70

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
수학    10 non-null int64
영어    10 non-null int64
과학    10 non-null int64
dtypes: int64(3)
memory usage: 368.0 bytes